MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB412/mcu.h
/* SPI4IMSKL */
/* Bitname _SPIRBFEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPITBFEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPITBEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPIRBEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPIROVEN cannot be defined because it is used by more than one SFR */
/* Bitname _SRMTEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPITUREN cannot be defined because it is used by more than one SFR */
/* Bitname _BUSYEN cannot be defined because it is used by more than one SFR */
/* Bitname _FRMERREN cannot be defined because it is used by more than one SFR */

/* SPI4IMSK2 */
/* Bitname _TXMSK cannot be defined because it is used by more than one SFR */
/* Bitname _TXWIEN cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK cannot be defined because it is used by more than one SFR */
/* Bitname _RXWIEN cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK5 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK2 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK3 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK4 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK5 cannot be defined because it is used by more than one SFR */

/* SPI4IMSKH */
/* Bitname _TXMSK cannot be defined because it is used by more than one SFR */
/* Bitname _TXWIEN cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK cannot be defined because it is used by more than one SFR */
/* Bitname _RXWIEN cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK5 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK2 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK3 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK4 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK5 cannot be defined because it is used by more than one SFR */

/* SPI4URDTL */
#define _SPI4URDTL SPI4URDTLbits.SPI4URDTL
/* Bitname _URDATA cannot be defined because it is used by more than one SFR */

/* SPI4URDTH */
#define _SPI4URDTH SPI4URDTHbits.SPI4URDTH
/* Bitname _URDATA cannot be defined because it is used by more than one SFR */

/* CLC1CONL */
/* Bitname _MODE cannot be defined because it is used by more than one SFR */
/* Bitname _LCPOL cannot be defined because it is used by more than one SFR */
/* Bitname _LCOUT cannot be defined because it is used by more than one SFR */
/* Bitname _LCOE cannot be defined because it is used by more than one SFR */
/* Bitname _INTN cannot be defined because it is used by more than one SFR */
/* Bitname _INTP cannot be defined because it is used by more than one SFR */
/* Bitname _LCEN cannot be defined because it is used by more than one SFR */
/* Bitname _MODE0 cannot be defined because it is used by more than one SFR */
/* Bitname _MODE1 cannot be defined because it is used by more than one SFR */
/* Bitname _MODE2 cannot be defined because it is used by more than one SFR */

/* CLC1CONH */
/* Bitname _G1POL cannot be defined because it is used by more than one SFR */
/* Bitname _G2POL cannot be defined because it is used by more than one SFR */
/* Bitname _G3POL cannot be defined because it is used by more than one SFR */
/* Bitname _G4POL cannot be defined because it is used by more than one SFR */

/* CLC1SEL */
/* Bitname _DS1 cannot be defined because it is used by more than one SFR */
/* Bitname _DS2 cannot be defined because it is used by more than one SFR */
/* Bitname _DS3 cannot be defined because it is used by more than one SFR */
/* Bitname _DS4 cannot be defined because it is used by more than one SFR */
/* Bitname _DS10 cannot be defined because it is used by more than one SFR */
/* Bitname _DS11 cannot be defined because it is used by more than one SFR */
/* Bitname _DS12 cannot be defined because it is used by more than one SFR */
/* Bitname _DS20 cannot be defined because it is used by more than one SFR */
/* Bitname _DS21 cannot be defined because it is used by more than one SFR */
/* Bitname _DS22 cannot be defined because it is used by more than one SFR */
/* Bitname _DS30 cannot be defined because it is used by more than one SFR */
/* Bitname _DS31 cannot be defined because it is used by more than one SFR */
/* Bitname _DS32 cannot be defined because it is used by more than one SFR */
/* Bitname _DS40 cannot be defined because it is used by more than one SFR */
/* Bitname _DS41 cannot be defined because it is used by more than one SFR */
/* Bitname _DS42 cannot be defined because it is used by more than one SFR */

