MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB412/mcu.h
/* LCDDATA6 */
#define _S32C1 LCDDATA6bits.S32C1
#define _S33C1 LCDDATA6bits.S33C1
#define _S34C1 LCDDATA6bits.S34C1
#define _S35C1 LCDDATA6bits.S35C1
#define _S36C1 LCDDATA6bits.S36C1
#define _S37C1 LCDDATA6bits.S37C1
#define _S38C1 LCDDATA6bits.S38C1
#define _S39C1 LCDDATA6bits.S39C1
#define _S40C1 LCDDATA6bits.S40C1
#define _S41C1 LCDDATA6bits.S41C1
#define _S42C1 LCDDATA6bits.S42C1
#define _S43C1 LCDDATA6bits.S43C1
#define _S44C1 LCDDATA6bits.S44C1
#define _S45C1 LCDDATA6bits.S45C1
#define _S46C1 LCDDATA6bits.S46C1
#define _S47C1 LCDDATA6bits.S47C1

/* LCDDATA7 */
#define _S48C1 LCDDATA7bits.S48C1
#define _S49C1 LCDDATA7bits.S49C1
#define _S50C1 LCDDATA7bits.S50C1
#define _S51C1 LCDDATA7bits.S51C1
#define _S52C1 LCDDATA7bits.S52C1
#define _S53C1 LCDDATA7bits.S53C1
#define _S54C1 LCDDATA7bits.S54C1
#define _S55C1 LCDDATA7bits.S55C1
#define _S56C1 LCDDATA7bits.S56C1
#define _S57C1 LCDDATA7bits.S57C1
#define _S58C1 LCDDATA7bits.S58C1
#define _S59C1 LCDDATA7bits.S59C1
#define _S60C1 LCDDATA7bits.S60C1
#define _S61C1 LCDDATA7bits.S61C1
#define _S62C1 LCDDATA7bits.S62C1
#define _S63C1 LCDDATA7bits.S63C1

/* LCDDATA8 */
#define _S00C2 LCDDATA8bits.S00C2
#define _S01C2 LCDDATA8bits.S01C2
#define _S02C2 LCDDATA8bits.S02C2
#define _S03C2 LCDDATA8bits.S03C2
#define _S04C2 LCDDATA8bits.S04C2
#define _S05C2 LCDDATA8bits.S05C2
#define _S06C2 LCDDATA8bits.S06C2
#define _S07C2 LCDDATA8bits.S07C2
#define _S08C2 LCDDATA8bits.S08C2
#define _S09C2 LCDDATA8bits.S09C2
#define _S10C2 LCDDATA8bits.S10C2
#define _S11C2 LCDDATA8bits.S11C2
#define _S12C2 LCDDATA8bits.S12C2
#define _S13C2 LCDDATA8bits.S13C2
#define _S14C2 LCDDATA8bits.S14C2
#define _S15C2 LCDDATA8bits.S15C2

/* LCDDATA9 */
#define _S16C2 LCDDATA9bits.S16C2
#define _S17C2 LCDDATA9bits.S17C2
#define _S18C2 LCDDATA9bits.S18C2
#define _S19C2 LCDDATA9bits.S19C2
#define _S20C2 LCDDATA9bits.S20C2
#define _S21C2 LCDDATA9bits.S21C2
#define _S22C2 LCDDATA9bits.S22C2
#define _S23C2 LCDDATA9bits.S23C2
#define _S24C2 LCDDATA9bits.S24C2
#define _S25C2 LCDDATA9bits.S25C2
#define _S26C2 LCDDATA9bits.S26C2
#define _S27C2 LCDDATA9bits.S27C2
#define _S28C2 LCDDATA9bits.S28C2
#define _S29C2 LCDDATA9bits.S29C2
#define _S30C2 LCDDATA9bits.S30C2
#define _S31C2 LCDDATA9bits.S31C2

/* LCDDATA10 */
#define _S32C2 LCDDATA10bits.S32C2
#define _S33C2 LCDDATA10bits.S33C2
#define _S34C2 LCDDATA10bits.S34C2
#define _S35C2 LCDDATA10bits.S35C2
#define _S36C2 LCDDATA10bits.S36C2
#define _S37C2 LCDDATA10bits.S37C2
#define _S38C2 LCDDATA10bits.S38C2
#define _S39C2 LCDDATA10bits.S39C2
#define _S40C2 LCDDATA10bits.S40C2
#define _S41C2 LCDDATA10bits.S41C2
#define _S42C2 LCDDATA10bits.S42C2
#define _S43C2 LCDDATA10bits.S43C2
#define _S44C2 LCDDATA10bits.S44C2
#define _S45C2 LCDDATA10bits.S45C2
#define _S46C2 LCDDATA10bits.S46C2
#define _S47C2 LCDDATA10bits.S47C2

/* LCDDATA11 */
#define _S48C2 LCDDATA11bits.S48C2
#define _S49C2 LCDDATA11bits.S49C2
#define _S50C2 LCDDATA11bits.S50C2
#define _S51C2 LCDDATA11bits.S51C2
#define _S52C2 LCDDATA11bits.S52C2
#define _S53C2 LCDDATA11bits.S53C2
#define _S54C2 LCDDATA11bits.S54C2
#define _S55C2 LCDDATA11bits.S55C2
#define _S56C2 LCDDATA11bits.S56C2
#define _S57C2 LCDDATA11bits.S57C2
#define _S58C2 LCDDATA11bits.S58C2
#define _S59C2 LCDDATA11bits.S59C2
#define _S60C2 LCDDATA11bits.S60C2
#define _S61C2 LCDDATA11bits.S61C2
#define _S62C2 LCDDATA11bits.S62C2
#define _S63C2 LCDDATA11bits.S63C2

/* LCDDATA12 */
#define _S00C3 LCDDATA12bits.S00C3
#define _S01C3 LCDDATA12bits.S01C3
#define _S02C3 LCDDATA12bits.S02C3
#define _S03C3 LCDDATA12bits.S03C3
#define _S04C3 LCDDATA12bits.S04C3
#define _S05C3 LCDDATA12bits.S05C3
#define _S06C3 LCDDATA12bits.S06C3
#define _S07C3 LCDDATA12bits.S07C3
#define _S08C3 LCDDATA12bits.S08C3
#define _S09C3 LCDDATA12bits.S09C3
#define _S10C3 LCDDATA12bits.S10C3
#define _S11C3 LCDDATA12bits.S11C3
#define _S12C3 LCDDATA12bits.S12C3
#define _S13C3 LCDDATA12bits.S13C3
#define _S14C3 LCDDATA12bits.S14C3
#define _S15C3 LCDDATA12bits.S15C3

/* LCDDATA13 */
#define _S16C3 LCDDATA13bits.S16C3
#define _S17C3 LCDDATA13bits.S17C3
#define _S18C3 LCDDATA13bits.S18C3
#define _S19C3 LCDDATA13bits.S19C3
#define _S20C3 LCDDATA13bits.S20C3
#define _S21C3 LCDDATA13bits.S21C3
#define _S22C3 LCDDATA13bits.S22C3
#define _S23C3 LCDDATA13bits.S23C3
#define _S24C3 LCDDATA13bits.S24C3
#define _S25C3 LCDDATA13bits.S25C3
#define _S26C3 LCDDATA13bits.S26C3
#define _S27C3 LCDDATA13bits.S27C3
#define _S28C3 LCDDATA13bits.S28C3
#define _S29C3 LCDDATA13bits.S29C3
#define _S30C3 LCDDATA13bits.S30C3
#define _S31C3 LCDDATA13bits.S31C3

/* LCDDATA14 */
#define _S32C3 LCDDATA14bits.S32C3
#define _S33C3 LCDDATA14bits.S33C3
#define _S34C3 LCDDATA14bits.S34C3
#define _S35C3 LCDDATA14bits.S35C3
#define _S36C3 LCDDATA14bits.S36C3
#define _S37C3 LCDDATA14bits.S37C3
#define _S38C3 LCDDATA14bits.S38C3
#define _S39C3 LCDDATA14bits.S39C3
#define _S40C3 LCDDATA14bits.S40C3
#define _S41C3 LCDDATA14bits.S41C3
#define _S42C3 LCDDATA14bits.S42C3
#define _S43C3 LCDDATA14bits.S43C3
#define _S44C3 LCDDATA14bits.S44C3
#define _S45C3 LCDDATA14bits.S45C3
#define _S46C3 LCDDATA14bits.S46C3
#define _S47C3 LCDDATA14bits.S47C3

/* LCDDATA15 */
#define _S48C3 LCDDATA15bits.S48C3
#define _S49C3 LCDDATA15bits.S49C3
#define _S50C3 LCDDATA15bits.S50C3
#define _S51C3 LCDDATA15bits.S51C3
#define _S52C3 LCDDATA15bits.S52C3
#define _S53C3 LCDDATA15bits.S53C3
#define _S54C3 LCDDATA15bits.S54C3
#define _S55C3 LCDDATA15bits.S55C3
#define _S56C3 LCDDATA15bits.S56C3
#define _S57C3 LCDDATA15bits.S57C3
#define _S58C3 LCDDATA15bits.S58C3
#define _S59C3 LCDDATA15bits.S59C3
#define _S60C3 LCDDATA15bits.S60C3
#define _S61C3 LCDDATA15bits.S61C3
#define _S62C3 LCDDATA15bits.S62C3
#define _S63C3 LCDDATA15bits.S63C3

/* LCDDATA16 */
#define _S00C4 LCDDATA16bits.S00C4
#define _S01C4 LCDDATA16bits.S01C4
#define _S02C4 LCDDATA16bits.S02C4
#define _S03C4 LCDDATA16bits.S03C4
#define _S04C4 LCDDATA16bits.S04C4
#define _S05C4 LCDDATA16bits.S05C4
#define _S06C4 LCDDATA16bits.S06C4
#define _S07C4 LCDDATA16bits.S07C4
#define _S08C4 LCDDATA16bits.S08C4
#define _S09C4 LCDDATA16bits.S09C4
#define _S10C4 LCDDATA16bits.S10C4
#define _S11C4 LCDDATA16bits.S11C4
#define _S12C4 LCDDATA16bits.S12C4
#define _S13C4 LCDDATA16bits.S13C4
#define _S14C4 LCDDATA16bits.S14C4
#define _S15C4 LCDDATA16bits.S15C4

/* LCDDATA17 */
#define _S16C4 LCDDATA17bits.S16C4
#define _S17C4 LCDDATA17bits.S17C4
#define _S18C4 LCDDATA17bits.S18C4
#define _S19C4 LCDDATA17bits.S19C4
#define _S20C4 LCDDATA17bits.S20C4
#define _S21C4 LCDDATA17bits.S21C4
#define _S22C4 LCDDATA17bits.S22C4
#define _S23C4 LCDDATA17bits.S23C4
#define _S24C4 LCDDATA17bits.S24C4
#define _S25C4 LCDDATA17bits.S25C4
#define _S26C4 LCDDATA17bits.S26C4
#define _S27C4 LCDDATA17bits.S27C4
#define _S28C4 LCDDATA17bits.S28C4
#define _S29C4 LCDDATA17bits.S29C4
#define _S30C4 LCDDATA17bits.S30C4
#define _S31C4 LCDDATA17bits.S31C4

/* LCDDATA18 */
#define _S32C4 LCDDATA18bits.S32C4
#define _S33C4 LCDDATA18bits.S33C4
#define _S34C4 LCDDATA18bits.S34C4
#define _S35C4 LCDDATA18bits.S35C4
#define _S36C4 LCDDATA18bits.S36C4
#define _S37C4 LCDDATA18bits.S37C4
#define _S38C4 LCDDATA18bits.S38C4
#define _S39C4 LCDDATA18bits.S39C4
#define _S40C4 LCDDATA18bits.S40C4
#define _S41C4 LCDDATA18bits.S41C4
#define _S42C4 LCDDATA18bits.S42C4
#define _S43C4 LCDDATA18bits.S43C4
#define _S44C4 LCDDATA18bits.S44C4
#define _S45C4 LCDDATA18bits.S45C4
#define _S46C4 LCDDATA18bits.S46C4
#define _S47C4 LCDDATA18bits.S47C4

/* LCDDATA19 */
#define _S48C4 LCDDATA19bits.S48C4
#define _S49C4 LCDDATA19bits.S49C4
#define _S50C4 LCDDATA19bits.S50C4
#define _S51C4 LCDDATA19bits.S51C4
#define _S52C4 LCDDATA19bits.S52C4
#define _S53C4 LCDDATA19bits.S53C4
#define _S54C4 LCDDATA19bits.S54C4
#define _S55C4 LCDDATA19bits.S55C4
#define _S56C4 LCDDATA19bits.S56C4
#define _S57C4 LCDDATA19bits.S57C4
#define _S58C4 LCDDATA19bits.S58C4
#define _S59C4 LCDDATA19bits.S59C4
#define _S60C4 LCDDATA19bits.S60C4
#define _S61C4 LCDDATA19bits.S61C4
#define _S62C4 LCDDATA19bits.S62C4
#define _S63C4 LCDDATA19bits.S63C4

