MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB412/mcu.h
#define _PMD5_CCP2MD_POSITION                    0x00000001
#define _PMD5_CCP2MD_MASK                        0x00000002
#define _PMD5_CCP2MD_LENGTH                      0x00000001

#define _PMD5_CCP3MD_POSITION                    0x00000002
#define _PMD5_CCP3MD_MASK                        0x00000004
#define _PMD5_CCP3MD_LENGTH                      0x00000001

#define _PMD5_CCP4MD_POSITION                    0x00000003
#define _PMD5_CCP4MD_MASK                        0x00000008
#define _PMD5_CCP4MD_LENGTH                      0x00000001

#define _PMD5_CCP5MD_POSITION                    0x00000004
#define _PMD5_CCP5MD_MASK                        0x00000010
#define _PMD5_CCP5MD_LENGTH                      0x00000001

#define _PMD5_CCP6MD_POSITION                    0x00000005
#define _PMD5_CCP6MD_MASK                        0x00000020
#define _PMD5_CCP6MD_LENGTH                      0x00000001

#define _PMD5_CCP7MD_POSITION                    0x00000006
#define _PMD5_CCP7MD_MASK                        0x00000040
#define _PMD5_CCP7MD_LENGTH                      0x00000001

#define _PMD6_SPI3MD_POSITION                    0x00000000
#define _PMD6_SPI3MD_MASK                        0x00000001
#define _PMD6_SPI3MD_LENGTH                      0x00000001

#define _PMD6_SPI4MD_POSITION                    0x00000001
#define _PMD6_SPI4MD_MASK                        0x00000002
#define _PMD6_SPI4MD_LENGTH                      0x00000001

#define _PMD6_LCDMD_POSITION                     0x00000006
#define _PMD6_LCDMD_MASK                         0x00000040
#define _PMD6_LCDMD_LENGTH                       0x00000001

#define _PMD7_DMA0MD_POSITION                    0x00000004
#define _PMD7_DMA0MD_MASK                        0x00000010
#define _PMD7_DMA0MD_LENGTH                      0x00000001

#define _PMD7_DMA1MD_POSITION                    0x00000005
#define _PMD7_DMA1MD_MASK                        0x00000020
#define _PMD7_DMA1MD_LENGTH                      0x00000001

#define _PMD8_CRYMD_POSITION                     0x00000000
#define _PMD8_CRYMD_MASK                         0x00000001
#define _PMD8_CRYMD_LENGTH                       0x00000001

#define _PMD8_CLC1MD_POSITION                    0x00000002
#define _PMD8_CLC1MD_MASK                        0x00000004
#define _PMD8_CLC1MD_LENGTH                      0x00000001

#define _PMD8_CLC2MD_POSITION                    0x00000003
#define _PMD8_CLC2MD_MASK                        0x00000008
#define _PMD8_CLC2MD_LENGTH                      0x00000001

#define _PMD8_CLC3MD_POSITION                    0x00000004
#define _PMD8_CLC3MD_MASK                        0x00000010
#define _PMD8_CLC3MD_LENGTH                      0x00000001

#define _PMD8_CLC4MD_POSITION                    0x00000005
#define _PMD8_CLC4MD_MASK                        0x00000020
#define _PMD8_CLC4MD_LENGTH                      0x00000001

#define _PMD8_U5MD_POSITION                      0x00000006
#define _PMD8_U5MD_MASK                          0x00000040
#define _PMD8_U5MD_LENGTH                        0x00000001

#define _PMD8_U6MD_POSITION                      0x00000007
#define _PMD8_U6MD_MASK                          0x00000080
#define _PMD8_U6MD_LENGTH                        0x00000001

#define _T1CON_TCS_POSITION                      0x00000001
#define _T1CON_TCS_MASK                          0x00000002
#define _T1CON_TCS_LENGTH                        0x00000001

#define _T1CON_TSYNC_POSITION                    0x00000002
#define _T1CON_TSYNC_MASK                        0x00000004
#define _T1CON_TSYNC_LENGTH                      0x00000001

#define _T1CON_TCKPS_POSITION                    0x00000004
#define _T1CON_TCKPS_MASK                        0x00000030
#define _T1CON_TCKPS_LENGTH                      0x00000002

#define _T1CON_TGATE_POSITION                    0x00000006
#define _T1CON_TGATE_MASK                        0x00000040
#define _T1CON_TGATE_LENGTH                      0x00000001

#define _T1CON_TECS_POSITION                     0x00000008
#define _T1CON_TECS_MASK                         0x00000300
#define _T1CON_TECS_LENGTH                       0x00000002

#define _T1CON_TSIDL_POSITION                    0x0000000D
#define _T1CON_TSIDL_MASK                        0x00002000
#define _T1CON_TSIDL_LENGTH                      0x00000001

#define _T1CON_TON_POSITION                      0x0000000F
#define _T1CON_TON_MASK                          0x00008000
#define _T1CON_TON_LENGTH                        0x00000001

#define _T1CON_TCKPS0_POSITION                   0x00000004
#define _T1CON_TCKPS0_MASK                       0x00000010
#define _T1CON_TCKPS0_LENGTH                     0x00000001

#define _T1CON_TCKPS1_POSITION                   0x00000005
#define _T1CON_TCKPS1_MASK                       0x00000020
#define _T1CON_TCKPS1_LENGTH                     0x00000001

#define _T1CON_T1ECS0_POSITION                   0x00000008
#define _T1CON_T1ECS0_MASK                       0x00000100
#define _T1CON_T1ECS0_LENGTH                     0x00000001

#define _T1CON_T1ECS1_POSITION                   0x00000009
#define _T1CON_T1ECS1_MASK                       0x00000200
#define _T1CON_T1ECS1_LENGTH                     0x00000001

#define _T1CON_T1ECS_POSITION                    0x00000008
#define _T1CON_T1ECS_MASK                        0x00000300
#define _T1CON_T1ECS_LENGTH                      0x00000002

#define _T1CON_TECS0_POSITION                    0x00000008
#define _T1CON_TECS0_MASK                        0x00000100
#define _T1CON_TECS0_LENGTH                      0x00000001

#define _T1CON_TECS1_POSITION                    0x00000009
#define _T1CON_TECS1_MASK                        0x00000200
#define _T1CON_TECS1_LENGTH                      0x00000001

#define _T1CON_TIECS_POSITION                    0x00000008
#define _T1CON_TIECS_MASK                        0x00000300
#define _T1CON_TIECS_LENGTH                      0x00000002

#define _T1CON_TIECS0_POSITION                   0x00000008
#define _T1CON_TIECS0_MASK                       0x00000100
#define _T1CON_TIECS0_LENGTH                     0x00000001

