MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB412/mcu.h
#define _DMAINT2_CHSEL3_POSITION                 0x0000000B
#define _DMAINT2_CHSEL3_MASK                     0x00000800
#define _DMAINT2_CHSEL3_LENGTH                   0x00000001

#define _DMAINT2_CHSEL4_POSITION                 0x0000000C
#define _DMAINT2_CHSEL4_MASK                     0x00001000
#define _DMAINT2_CHSEL4_LENGTH                   0x00000001

#define _DMAINT2_CHSEL5_POSITION                 0x0000000D
#define _DMAINT2_CHSEL5_MASK                     0x00002000
#define _DMAINT2_CHSEL5_LENGTH                   0x00000001

#define _DMAINT2_CHSEL6_POSITION                 0x0000000E
#define _DMAINT2_CHSEL6_MASK                     0x00004000
#define _DMAINT2_CHSEL6_LENGTH                   0x00000001

#define _DMACH3_CHEN_POSITION                    0x00000000
#define _DMACH3_CHEN_MASK                        0x00000001
#define _DMACH3_CHEN_LENGTH                      0x00000001

#define _DMACH3_SIZE_POSITION                    0x00000001
#define _DMACH3_SIZE_MASK                        0x00000002
#define _DMACH3_SIZE_LENGTH                      0x00000001

#define _DMACH3_TRMODE_POSITION                  0x00000002
#define _DMACH3_TRMODE_MASK                      0x0000000C
#define _DMACH3_TRMODE_LENGTH                    0x00000002

#define _DMACH3_DAMODE_POSITION                  0x00000004
#define _DMACH3_DAMODE_MASK                      0x00000030
#define _DMACH3_DAMODE_LENGTH                    0x00000002

#define _DMACH3_SAMODE_POSITION                  0x00000006
#define _DMACH3_SAMODE_MASK                      0x000000C0
#define _DMACH3_SAMODE_LENGTH                    0x00000002

#define _DMACH3_CHREQ_POSITION                   0x00000008
#define _DMACH3_CHREQ_MASK                       0x00000100
#define _DMACH3_CHREQ_LENGTH                     0x00000001

#define _DMACH3_RELOAD_POSITION                  0x00000009
#define _DMACH3_RELOAD_MASK                      0x00000200
#define _DMACH3_RELOAD_LENGTH                    0x00000001

#define _DMACH3_NULLW_POSITION                   0x0000000A
#define _DMACH3_NULLW_MASK                       0x00000400
#define _DMACH3_NULLW_LENGTH                     0x00000001

#define _DMACH3_TRMODE0_POSITION                 0x00000002
#define _DMACH3_TRMODE0_MASK                     0x00000004
#define _DMACH3_TRMODE0_LENGTH                   0x00000001

#define _DMACH3_TRMODE1_POSITION                 0x00000003
#define _DMACH3_TRMODE1_MASK                     0x00000008
#define _DMACH3_TRMODE1_LENGTH                   0x00000001

#define _DMACH3_DAMODE0_POSITION                 0x00000004
#define _DMACH3_DAMODE0_MASK                     0x00000010
#define _DMACH3_DAMODE0_LENGTH                   0x00000001

#define _DMACH3_DAMODE1_POSITION                 0x00000005
#define _DMACH3_DAMODE1_MASK                     0x00000020
#define _DMACH3_DAMODE1_LENGTH                   0x00000001

#define _DMACH3_SAMODE0_POSITION                 0x00000006
#define _DMACH3_SAMODE0_MASK                     0x00000040
#define _DMACH3_SAMODE0_LENGTH                   0x00000001

#define _DMACH3_SAMODE1_POSITION                 0x00000007
#define _DMACH3_SAMODE1_MASK                     0x00000080
#define _DMACH3_SAMODE1_LENGTH                   0x00000001

#define _DMAINT3_HALFEN_POSITION                 0x00000000
#define _DMAINT3_HALFEN_MASK                     0x00000001
#define _DMAINT3_HALFEN_LENGTH                   0x00000001

#define _DMAINT3_OVRUNIF_POSITION                0x00000003
#define _DMAINT3_OVRUNIF_MASK                    0x00000008
#define _DMAINT3_OVRUNIF_LENGTH                  0x00000001

#define _DMAINT3_HALFIF_POSITION                 0x00000004
#define _DMAINT3_HALFIF_MASK                     0x00000010
#define _DMAINT3_HALFIF_LENGTH                   0x00000001

#define _DMAINT3_DONEIF_POSITION                 0x00000005
#define _DMAINT3_DONEIF_MASK                     0x00000020
#define _DMAINT3_DONEIF_LENGTH                   0x00000001

#define _DMAINT3_LOWIF_POSITION                  0x00000006
#define _DMAINT3_LOWIF_MASK                      0x00000040
#define _DMAINT3_LOWIF_LENGTH                    0x00000001

#define _DMAINT3_HIGHIF_POSITION                 0x00000007
#define _DMAINT3_HIGHIF_MASK                     0x00000080
#define _DMAINT3_HIGHIF_LENGTH                   0x00000001

#define _DMAINT3_CHSEL_POSITION                  0x00000008
#define _DMAINT3_CHSEL_MASK                      0x00007F00
#define _DMAINT3_CHSEL_LENGTH                    0x00000007

#define _DMAINT3_DBUFWF_POSITION                 0x0000000F
#define _DMAINT3_DBUFWF_MASK                     0x00008000
#define _DMAINT3_DBUFWF_LENGTH                   0x00000001

#define _DMAINT3_CHSEL0_POSITION                 0x00000008
#define _DMAINT3_CHSEL0_MASK                     0x00000100
#define _DMAINT3_CHSEL0_LENGTH                   0x00000001

#define _DMAINT3_CHSEL1_POSITION                 0x00000009
#define _DMAINT3_CHSEL1_MASK                     0x00000200
#define _DMAINT3_CHSEL1_LENGTH                   0x00000001

#define _DMAINT3_CHSEL2_POSITION                 0x0000000A
#define _DMAINT3_CHSEL2_MASK                     0x00000400
#define _DMAINT3_CHSEL2_LENGTH                   0x00000001

#define _DMAINT3_CHSEL3_POSITION                 0x0000000B
#define _DMAINT3_CHSEL3_MASK                     0x00000800
#define _DMAINT3_CHSEL3_LENGTH                   0x00000001

#define _DMAINT3_CHSEL4_POSITION                 0x0000000C
#define _DMAINT3_CHSEL4_MASK                     0x00001000
#define _DMAINT3_CHSEL4_LENGTH                   0x00000001

#define _DMAINT3_CHSEL5_POSITION                 0x0000000D
#define _DMAINT3_CHSEL5_MASK                     0x00002000
#define _DMAINT3_CHSEL5_LENGTH                   0x00000001

#define _DMAINT3_CHSEL6_POSITION                 0x0000000E
#define _DMAINT3_CHSEL6_MASK                     0x00004000
#define _DMAINT3_CHSEL6_LENGTH                   0x00000001

#define _DMACH4_CHEN_POSITION                    0x00000000
#define _DMACH4_CHEN_MASK                        0x00000001
#define _DMACH4_CHEN_LENGTH                      0x00000001

