MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB412/mcu.h
#define _LCDDATA30_S45C7_POSITION                0x0000000D
#define _LCDDATA30_S45C7_MASK                    0x00002000
#define _LCDDATA30_S45C7_LENGTH                  0x00000001

#define _LCDDATA30_S46C7_POSITION                0x0000000E
#define _LCDDATA30_S46C7_MASK                    0x00004000
#define _LCDDATA30_S46C7_LENGTH                  0x00000001

#define _LCDDATA30_S47C7_POSITION                0x0000000F
#define _LCDDATA30_S47C7_MASK                    0x00008000
#define _LCDDATA30_S47C7_LENGTH                  0x00000001

#define _LCDDATA31_S48C7_POSITION                0x00000000
#define _LCDDATA31_S48C7_MASK                    0x00000001
#define _LCDDATA31_S48C7_LENGTH                  0x00000001

#define _LCDDATA31_S49C7_POSITION                0x00000001
#define _LCDDATA31_S49C7_MASK                    0x00000002
#define _LCDDATA31_S49C7_LENGTH                  0x00000001

#define _LCDDATA31_S50C7_POSITION                0x00000002
#define _LCDDATA31_S50C7_MASK                    0x00000004
#define _LCDDATA31_S50C7_LENGTH                  0x00000001

#define _LCDDATA31_S51C7_POSITION                0x00000003
#define _LCDDATA31_S51C7_MASK                    0x00000008
#define _LCDDATA31_S51C7_LENGTH                  0x00000001

#define _LCDDATA31_S52C7_POSITION                0x00000004
#define _LCDDATA31_S52C7_MASK                    0x00000010
#define _LCDDATA31_S52C7_LENGTH                  0x00000001

#define _LCDDATA31_S53C7_POSITION                0x00000005
#define _LCDDATA31_S53C7_MASK                    0x00000020
#define _LCDDATA31_S53C7_LENGTH                  0x00000001

#define _LCDDATA31_S54C7_POSITION                0x00000006
#define _LCDDATA31_S54C7_MASK                    0x00000040
#define _LCDDATA31_S54C7_LENGTH                  0x00000001

#define _LCDDATA31_S55C7_POSITION                0x00000007
#define _LCDDATA31_S55C7_MASK                    0x00000080
#define _LCDDATA31_S55C7_LENGTH                  0x00000001

#define _LCDDATA31_S56C7_POSITION                0x00000008
#define _LCDDATA31_S56C7_MASK                    0x00000100
#define _LCDDATA31_S56C7_LENGTH                  0x00000001

#define _LCDDATA31_S57C7_POSITION                0x00000009
#define _LCDDATA31_S57C7_MASK                    0x00000200
#define _LCDDATA31_S57C7_LENGTH                  0x00000001

#define _LCDDATA31_S58C7_POSITION                0x0000000A
#define _LCDDATA31_S58C7_MASK                    0x00000400
#define _LCDDATA31_S58C7_LENGTH                  0x00000001

#define _LCDDATA31_S59C7_POSITION                0x0000000B
#define _LCDDATA31_S59C7_MASK                    0x00000800
#define _LCDDATA31_S59C7_LENGTH                  0x00000001

#define _LCDDATA31_S60C7_POSITION                0x0000000C
#define _LCDDATA31_S60C7_MASK                    0x00001000
#define _LCDDATA31_S60C7_LENGTH                  0x00000001

#define _LCDDATA31_S61C7_POSITION                0x0000000D
#define _LCDDATA31_S61C7_MASK                    0x00002000
#define _LCDDATA31_S61C7_LENGTH                  0x00000001

#define _LCDDATA31_S62C7_POSITION                0x0000000E
#define _LCDDATA31_S62C7_MASK                    0x00004000
#define _LCDDATA31_S62C7_LENGTH                  0x00000001

#define _LCDDATA31_S63C7_POSITION                0x0000000F
#define _LCDDATA31_S63C7_MASK                    0x00008000
#define _LCDDATA31_S63C7_LENGTH                  0x00000001

#define _LCDSE0_SE00_POSITION                    0x00000000
#define _LCDSE0_SE00_MASK                        0x00000001
#define _LCDSE0_SE00_LENGTH                      0x00000001

#define _LCDSE0_SE01_POSITION                    0x00000001
#define _LCDSE0_SE01_MASK                        0x00000002
#define _LCDSE0_SE01_LENGTH                      0x00000001

#define _LCDSE0_SE02_POSITION                    0x00000002
#define _LCDSE0_SE02_MASK                        0x00000004
#define _LCDSE0_SE02_LENGTH                      0x00000001

#define _LCDSE0_SE03_POSITION                    0x00000003
#define _LCDSE0_SE03_MASK                        0x00000008
#define _LCDSE0_SE03_LENGTH                      0x00000001

#define _LCDSE0_SE04_POSITION                    0x00000004
#define _LCDSE0_SE04_MASK                        0x00000010
#define _LCDSE0_SE04_LENGTH                      0x00000001

#define _LCDSE0_SE05_POSITION                    0x00000005
#define _LCDSE0_SE05_MASK                        0x00000020
#define _LCDSE0_SE05_LENGTH                      0x00000001

#define _LCDSE0_SE06_POSITION                    0x00000006
#define _LCDSE0_SE06_MASK                        0x00000040
#define _LCDSE0_SE06_LENGTH                      0x00000001

#define _LCDSE0_SE07_POSITION                    0x00000007
#define _LCDSE0_SE07_MASK                        0x00000080
#define _LCDSE0_SE07_LENGTH                      0x00000001

#define _LCDSE0_SE08_POSITION                    0x00000008
#define _LCDSE0_SE08_MASK                        0x00000100
#define _LCDSE0_SE08_LENGTH                      0x00000001

#define _LCDSE0_SE09_POSITION                    0x00000009
#define _LCDSE0_SE09_MASK                        0x00000200
#define _LCDSE0_SE09_LENGTH                      0x00000001

#define _LCDSE0_SE10_POSITION                    0x0000000A
#define _LCDSE0_SE10_MASK                        0x00000400
#define _LCDSE0_SE10_LENGTH                      0x00000001

#define _LCDSE0_SE11_POSITION                    0x0000000B
#define _LCDSE0_SE11_MASK                        0x00000800
#define _LCDSE0_SE11_LENGTH                      0x00000001

#define _LCDSE0_SE12_POSITION                    0x0000000C
#define _LCDSE0_SE12_MASK                        0x00001000
#define _LCDSE0_SE12_LENGTH                      0x00000001

#define _LCDSE0_SE13_POSITION                    0x0000000D
#define _LCDSE0_SE13_MASK                        0x00002000
#define _LCDSE0_SE13_LENGTH                      0x00000001

#define _LCDSE0_SE14_POSITION                    0x0000000E
#define _LCDSE0_SE14_MASK                        0x00004000
#define _LCDSE0_SE14_LENGTH                      0x00000001

#define _LCDSE0_SE15_POSITION                    0x0000000F
#define _LCDSE0_SE15_MASK                        0x00008000
#define _LCDSE0_SE15_LENGTH                      0x00000001

#define _LCDSE1_SE16_POSITION                    0x00000000
#define _LCDSE1_SE16_MASK                        0x00000001
#define _LCDSE1_SE16_LENGTH                      0x00000001

#define _LCDSE1_SE17_POSITION                    0x00000001
#define _LCDSE1_SE17_MASK                        0x00000002
#define _LCDSE1_SE17_LENGTH                      0x00000001

#define _LCDSE1_SE18_POSITION                    0x00000002
#define _LCDSE1_SE18_MASK                        0x00000004
#define _LCDSE1_SE18_LENGTH                      0x00000001

