MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB412/mcu.h
#define _CNPUE_CNPUE4_POSITION                   0x00000004
#define _CNPUE_CNPUE4_MASK                       0x00000010
#define _CNPUE_CNPUE4_LENGTH                     0x00000001

#define _CNPUE_CNPUE5_POSITION                   0x00000005
#define _CNPUE_CNPUE5_MASK                       0x00000020
#define _CNPUE_CNPUE5_LENGTH                     0x00000001

#define _CNPUE_CNPUE6_POSITION                   0x00000006
#define _CNPUE_CNPUE6_MASK                       0x00000040
#define _CNPUE_CNPUE6_LENGTH                     0x00000001

#define _CNPUE_CNPUE7_POSITION                   0x00000007
#define _CNPUE_CNPUE7_MASK                       0x00000080
#define _CNPUE_CNPUE7_LENGTH                     0x00000001

#define _CNPUE_CNPUE8_POSITION                   0x00000008
#define _CNPUE_CNPUE8_MASK                       0x00000100
#define _CNPUE_CNPUE8_LENGTH                     0x00000001

#define _CNPUE_CNPUE9_POSITION                   0x00000009
#define _CNPUE_CNPUE9_MASK                       0x00000200
#define _CNPUE_CNPUE9_LENGTH                     0x00000001

#define _IOCPUE_IOCPE0_POSITION                  0x00000000
#define _IOCPUE_IOCPE0_MASK                      0x00000001
#define _IOCPUE_IOCPE0_LENGTH                    0x00000001

#define _IOCPUE_IOCPE1_POSITION                  0x00000001
#define _IOCPUE_IOCPE1_MASK                      0x00000002
#define _IOCPUE_IOCPE1_LENGTH                    0x00000001

#define _IOCPUE_IOCPE2_POSITION                  0x00000002
#define _IOCPUE_IOCPE2_MASK                      0x00000004
#define _IOCPUE_IOCPE2_LENGTH                    0x00000001

#define _IOCPUE_IOCPE3_POSITION                  0x00000003
#define _IOCPUE_IOCPE3_MASK                      0x00000008
#define _IOCPUE_IOCPE3_LENGTH                    0x00000001

#define _IOCPUE_IOCPE4_POSITION                  0x00000004
#define _IOCPUE_IOCPE4_MASK                      0x00000010
#define _IOCPUE_IOCPE4_LENGTH                    0x00000001

#define _IOCPUE_IOCPE5_POSITION                  0x00000005
#define _IOCPUE_IOCPE5_MASK                      0x00000020
#define _IOCPUE_IOCPE5_LENGTH                    0x00000001

#define _IOCPUE_IOCPE6_POSITION                  0x00000006
#define _IOCPUE_IOCPE6_MASK                      0x00000040
#define _IOCPUE_IOCPE6_LENGTH                    0x00000001

#define _IOCPUE_IOCPE7_POSITION                  0x00000007
#define _IOCPUE_IOCPE7_MASK                      0x00000080
#define _IOCPUE_IOCPE7_LENGTH                    0x00000001

#define _IOCPUE_IOCPE8_POSITION                  0x00000008
#define _IOCPUE_IOCPE8_MASK                      0x00000100
#define _IOCPUE_IOCPE8_LENGTH                    0x00000001

#define _IOCPUE_IOCPE9_POSITION                  0x00000009
#define _IOCPUE_IOCPE9_MASK                      0x00000200
#define _IOCPUE_IOCPE9_LENGTH                    0x00000001

#define _IOCPUE_IOCPUE0_POSITION                 0x00000000
#define _IOCPUE_IOCPUE0_MASK                     0x00000001
#define _IOCPUE_IOCPUE0_LENGTH                   0x00000001

#define _IOCPUE_IOCPUE1_POSITION                 0x00000001
#define _IOCPUE_IOCPUE1_MASK                     0x00000002
#define _IOCPUE_IOCPUE1_LENGTH                   0x00000001

#define _IOCPUE_IOCPUE2_POSITION                 0x00000002
#define _IOCPUE_IOCPUE2_MASK                     0x00000004
#define _IOCPUE_IOCPUE2_LENGTH                   0x00000001

#define _IOCPUE_IOCPUE3_POSITION                 0x00000003
#define _IOCPUE_IOCPUE3_MASK                     0x00000008
#define _IOCPUE_IOCPUE3_LENGTH                   0x00000001

#define _IOCPUE_IOCPUE4_POSITION                 0x00000004
#define _IOCPUE_IOCPUE4_MASK                     0x00000010
#define _IOCPUE_IOCPUE4_LENGTH                   0x00000001

#define _IOCPUE_IOCPUE5_POSITION                 0x00000005
#define _IOCPUE_IOCPUE5_MASK                     0x00000020
#define _IOCPUE_IOCPUE5_LENGTH                   0x00000001

#define _IOCPUE_IOCPUE6_POSITION                 0x00000006
#define _IOCPUE_IOCPUE6_MASK                     0x00000040
#define _IOCPUE_IOCPUE6_LENGTH                   0x00000001

#define _IOCPUE_IOCPUE7_POSITION                 0x00000007
#define _IOCPUE_IOCPUE7_MASK                     0x00000080
#define _IOCPUE_IOCPUE7_LENGTH                   0x00000001

#define _IOCPUE_IOCPUE8_POSITION                 0x00000008
#define _IOCPUE_IOCPUE8_MASK                     0x00000100
#define _IOCPUE_IOCPUE8_LENGTH                   0x00000001

#define _IOCPUE_IOCPUE9_POSITION                 0x00000009
#define _IOCPUE_IOCPUE9_MASK                     0x00000200
#define _IOCPUE_IOCPUE9_LENGTH                   0x00000001

#define _IOCPUE_CNPUE0_POSITION                  0x00000000
#define _IOCPUE_CNPUE0_MASK                      0x00000001
#define _IOCPUE_CNPUE0_LENGTH                    0x00000001

#define _IOCPUE_CNPUE1_POSITION                  0x00000001
#define _IOCPUE_CNPUE1_MASK                      0x00000002
#define _IOCPUE_CNPUE1_LENGTH                    0x00000001

#define _IOCPUE_CNPUE2_POSITION                  0x00000002
#define _IOCPUE_CNPUE2_MASK                      0x00000004
#define _IOCPUE_CNPUE2_LENGTH                    0x00000001

#define _IOCPUE_CNPUE3_POSITION                  0x00000003
#define _IOCPUE_CNPUE3_MASK                      0x00000008
#define _IOCPUE_CNPUE3_LENGTH                    0x00000001

#define _IOCPUE_CNPUE4_POSITION                  0x00000004
#define _IOCPUE_CNPUE4_MASK                      0x00000010
#define _IOCPUE_CNPUE4_LENGTH                    0x00000001

#define _IOCPUE_CNPUE5_POSITION                  0x00000005
#define _IOCPUE_CNPUE5_MASK                      0x00000020
#define _IOCPUE_CNPUE5_LENGTH                    0x00000001

#define _IOCPUE_CNPUE6_POSITION                  0x00000006
#define _IOCPUE_CNPUE6_MASK                      0x00000040
#define _IOCPUE_CNPUE6_LENGTH                    0x00000001

#define _IOCPUE_CNPUE7_POSITION                  0x00000007
#define _IOCPUE_CNPUE7_MASK                      0x00000080
#define _IOCPUE_CNPUE7_LENGTH                    0x00000001

#define _IOCPUE_CNPUE8_POSITION                  0x00000008
#define _IOCPUE_CNPUE8_MASK                      0x00000100
#define _IOCPUE_CNPUE8_LENGTH                    0x00000001

#define _IOCPUE_CNPUE9_POSITION                  0x00000009
#define _IOCPUE_CNPUE9_MASK                      0x00000200
#define _IOCPUE_CNPUE9_LENGTH                    0x00000001

#define _CNPDE_IOCPDE0_POSITION                  0x00000000
#define _CNPDE_IOCPDE0_MASK                      0x00000001
#define _CNPDE_IOCPDE0_LENGTH                    0x00000001

#define _CNPDE_IOCPDE1_POSITION                  0x00000001
#define _CNPDE_IOCPDE1_MASK                      0x00000002
#define _CNPDE_IOCPDE1_LENGTH                    0x00000001

#define _CNPDE_IOCPDE2_POSITION                  0x00000002
#define _CNPDE_IOCPDE2_MASK                      0x00000004
#define _CNPDE_IOCPDE2_LENGTH                    0x00000001

#define _CNPDE_IOCPDE3_POSITION                  0x00000003
#define _CNPDE_IOCPDE3_MASK                      0x00000008
#define _CNPDE_IOCPDE3_LENGTH                    0x00000001

#define _CNPDE_IOCPDE4_POSITION                  0x00000004
#define _CNPDE_IOCPDE4_MASK                      0x00000010
#define _CNPDE_IOCPDE4_LENGTH                    0x00000001

#define _CNPDE_IOCPDE5_POSITION                  0x00000005
#define _CNPDE_IOCPDE5_MASK                      0x00000020
#define _CNPDE_IOCPDE5_LENGTH                    0x00000001

