MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB412/mcu.h
#define _LATG_LATG8_POSITION                     0x00000008
#define _LATG_LATG8_MASK                         0x00000100
#define _LATG_LATG8_LENGTH                       0x00000001

#define _LATG_LATG9_POSITION                     0x00000009
#define _LATG_LATG9_MASK                         0x00000200
#define _LATG_LATG9_LENGTH                       0x00000001

#define _LATG_LATG12_POSITION                    0x0000000C
#define _LATG_LATG12_MASK                        0x00001000
#define _LATG_LATG12_LENGTH                      0x00000001

#define _LATG_LATG13_POSITION                    0x0000000D
#define _LATG_LATG13_MASK                        0x00002000
#define _LATG_LATG13_LENGTH                      0x00000001

#define _LATG_LATG14_POSITION                    0x0000000E
#define _LATG_LATG14_MASK                        0x00004000
#define _LATG_LATG14_LENGTH                      0x00000001

#define _LATG_LATG15_POSITION                    0x0000000F
#define _LATG_LATG15_MASK                        0x00008000
#define _LATG_LATG15_LENGTH                      0x00000001

#define _ODCG_ODCG0_POSITION                     0x00000000
#define _ODCG_ODCG0_MASK                         0x00000001
#define _ODCG_ODCG0_LENGTH                       0x00000001

#define _ODCG_ODCG1_POSITION                     0x00000001
#define _ODCG_ODCG1_MASK                         0x00000002
#define _ODCG_ODCG1_LENGTH                       0x00000001

#define _ODCG_ODCG2_POSITION                     0x00000002
#define _ODCG_ODCG2_MASK                         0x00000004
#define _ODCG_ODCG2_LENGTH                       0x00000001

#define _ODCG_ODCG3_POSITION                     0x00000003
#define _ODCG_ODCG3_MASK                         0x00000008
#define _ODCG_ODCG3_LENGTH                       0x00000001

#define _ODCG_ODCG6_POSITION                     0x00000006
#define _ODCG_ODCG6_MASK                         0x00000040
#define _ODCG_ODCG6_LENGTH                       0x00000001

#define _ODCG_ODCG7_POSITION                     0x00000007
#define _ODCG_ODCG7_MASK                         0x00000080
#define _ODCG_ODCG7_LENGTH                       0x00000001

#define _ODCG_ODCG8_POSITION                     0x00000008
#define _ODCG_ODCG8_MASK                         0x00000100
#define _ODCG_ODCG8_LENGTH                       0x00000001

#define _ODCG_ODCG9_POSITION                     0x00000009
#define _ODCG_ODCG9_MASK                         0x00000200
#define _ODCG_ODCG9_LENGTH                       0x00000001

#define _ODCG_ODCG12_POSITION                    0x0000000C
#define _ODCG_ODCG12_MASK                        0x00001000
#define _ODCG_ODCG12_LENGTH                      0x00000001

#define _ODCG_ODCG13_POSITION                    0x0000000D
#define _ODCG_ODCG13_MASK                        0x00002000
#define _ODCG_ODCG13_LENGTH                      0x00000001

#define _ODCG_ODCG14_POSITION                    0x0000000E
#define _ODCG_ODCG14_MASK                        0x00004000
#define _ODCG_ODCG14_LENGTH                      0x00000001

#define _ODCG_ODCG15_POSITION                    0x0000000F
#define _ODCG_ODCG15_MASK                        0x00008000
#define _ODCG_ODCG15_LENGTH                      0x00000001

#define _ANSELG_ANSG0_POSITION                   0x00000000
#define _ANSELG_ANSG0_MASK                       0x00000001
#define _ANSELG_ANSG0_LENGTH                     0x00000001

#define _ANSELG_ANSG1_POSITION                   0x00000001
#define _ANSELG_ANSG1_MASK                       0x00000002
#define _ANSELG_ANSG1_LENGTH                     0x00000001

#define _ANSELG_ANSG6_POSITION                   0x00000006
#define _ANSELG_ANSG6_MASK                       0x00000040
#define _ANSELG_ANSG6_LENGTH                     0x00000001

#define _ANSELG_ANSG7_POSITION                   0x00000007
#define _ANSELG_ANSG7_MASK                       0x00000080
#define _ANSELG_ANSG7_LENGTH                     0x00000001

#define _ANSELG_ANSG8_POSITION                   0x00000008
#define _ANSELG_ANSG8_MASK                       0x00000100
#define _ANSELG_ANSG8_LENGTH                     0x00000001

#define _ANSELG_ANSG9_POSITION                   0x00000009
#define _ANSELG_ANSG9_MASK                       0x00000200
#define _ANSELG_ANSG9_LENGTH                     0x00000001

#define _ANSELG_ANSG12_POSITION                  0x0000000C
#define _ANSELG_ANSG12_MASK                      0x00001000
#define _ANSELG_ANSG12_LENGTH                    0x00000001

#define _ANSELG_ANSG13_POSITION                  0x0000000D
#define _ANSELG_ANSG13_MASK                      0x00002000
#define _ANSELG_ANSG13_LENGTH                    0x00000001

#define _ANSELG_ANSG14_POSITION                  0x0000000E
#define _ANSELG_ANSG14_MASK                      0x00004000
#define _ANSELG_ANSG14_LENGTH                    0x00000001

#define _ANSELG_ANSG15_POSITION                  0x0000000F
#define _ANSELG_ANSG15_MASK                      0x00008000
#define _ANSELG_ANSG15_LENGTH                    0x00000001

#define _ANSELG_ANSELG0_POSITION                 0x00000000
#define _ANSELG_ANSELG0_MASK                     0x00000001
#define _ANSELG_ANSELG0_LENGTH                   0x00000001

#define _ANSELG_ANSELG1_POSITION                 0x00000001
#define _ANSELG_ANSELG1_MASK                     0x00000002
#define _ANSELG_ANSELG1_LENGTH                   0x00000001

#define _ANSELG_ANSELG6_POSITION                 0x00000006
#define _ANSELG_ANSELG6_MASK                     0x00000040
#define _ANSELG_ANSELG6_LENGTH                   0x00000001

#define _ANSELG_ANSELG7_POSITION                 0x00000007
#define _ANSELG_ANSELG7_MASK                     0x00000080
#define _ANSELG_ANSELG7_LENGTH                   0x00000001

#define _ANSELG_ANSELG8_POSITION                 0x00000008
#define _ANSELG_ANSELG8_MASK                     0x00000100
#define _ANSELG_ANSELG8_LENGTH                   0x00000001

#define _ANSELG_ANSELG9_POSITION                 0x00000009
#define _ANSELG_ANSELG9_MASK                     0x00000200
#define _ANSELG_ANSELG9_LENGTH                   0x00000001

