MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB412/mcu.h
#define _CNPDG_CNPDG12_POSITION                  0x0000000C
#define _CNPDG_CNPDG12_MASK                      0x00001000
#define _CNPDG_CNPDG12_LENGTH                    0x00000001

#define _CNPDG_CNPDG13_POSITION                  0x0000000D
#define _CNPDG_CNPDG13_MASK                      0x00002000
#define _CNPDG_CNPDG13_LENGTH                    0x00000001

#define _CNPDG_CNPDG14_POSITION                  0x0000000E
#define _CNPDG_CNPDG14_MASK                      0x00004000
#define _CNPDG_CNPDG14_LENGTH                    0x00000001

#define _CNPDG_CNPDG15_POSITION                  0x0000000F
#define _CNPDG_CNPDG15_MASK                      0x00008000
#define _CNPDG_CNPDG15_LENGTH                    0x00000001

#define _IOCPDG_IOCPDG0_POSITION                 0x00000000
#define _IOCPDG_IOCPDG0_MASK                     0x00000001
#define _IOCPDG_IOCPDG0_LENGTH                   0x00000001

#define _IOCPDG_IOCPDG1_POSITION                 0x00000001
#define _IOCPDG_IOCPDG1_MASK                     0x00000002
#define _IOCPDG_IOCPDG1_LENGTH                   0x00000001

#define _IOCPDG_IOCPDG2_POSITION                 0x00000002
#define _IOCPDG_IOCPDG2_MASK                     0x00000004
#define _IOCPDG_IOCPDG2_LENGTH                   0x00000001

#define _IOCPDG_IOCPDG3_POSITION                 0x00000003
#define _IOCPDG_IOCPDG3_MASK                     0x00000008
#define _IOCPDG_IOCPDG3_LENGTH                   0x00000001

#define _IOCPDG_IOCPDG6_POSITION                 0x00000006
#define _IOCPDG_IOCPDG6_MASK                     0x00000040
#define _IOCPDG_IOCPDG6_LENGTH                   0x00000001

#define _IOCPDG_IOCPDG7_POSITION                 0x00000007
#define _IOCPDG_IOCPDG7_MASK                     0x00000080
#define _IOCPDG_IOCPDG7_LENGTH                   0x00000001

#define _IOCPDG_IOCPDG8_POSITION                 0x00000008
#define _IOCPDG_IOCPDG8_MASK                     0x00000100
#define _IOCPDG_IOCPDG8_LENGTH                   0x00000001

#define _IOCPDG_IOCPDG9_POSITION                 0x00000009
#define _IOCPDG_IOCPDG9_MASK                     0x00000200
#define _IOCPDG_IOCPDG9_LENGTH                   0x00000001

#define _IOCPDG_IOCPDG12_POSITION                0x0000000C
#define _IOCPDG_IOCPDG12_MASK                    0x00001000
#define _IOCPDG_IOCPDG12_LENGTH                  0x00000001

#define _IOCPDG_IOCPDG13_POSITION                0x0000000D
#define _IOCPDG_IOCPDG13_MASK                    0x00002000
#define _IOCPDG_IOCPDG13_LENGTH                  0x00000001

#define _IOCPDG_IOCPDG14_POSITION                0x0000000E
#define _IOCPDG_IOCPDG14_MASK                    0x00004000
#define _IOCPDG_IOCPDG14_LENGTH                  0x00000001

#define _IOCPDG_IOCPDG15_POSITION                0x0000000F
#define _IOCPDG_IOCPDG15_MASK                    0x00008000
#define _IOCPDG_IOCPDG15_LENGTH                  0x00000001

#define _IOCPDG_CNPDG0_POSITION                  0x00000000
#define _IOCPDG_CNPDG0_MASK                      0x00000001
#define _IOCPDG_CNPDG0_LENGTH                    0x00000001

#define _IOCPDG_CNPDG1_POSITION                  0x00000001
#define _IOCPDG_CNPDG1_MASK                      0x00000002
#define _IOCPDG_CNPDG1_LENGTH                    0x00000001

#define _IOCPDG_CNPDG2_POSITION                  0x00000002
#define _IOCPDG_CNPDG2_MASK                      0x00000004
#define _IOCPDG_CNPDG2_LENGTH                    0x00000001

#define _IOCPDG_CNPDG3_POSITION                  0x00000003
#define _IOCPDG_CNPDG3_MASK                      0x00000008
#define _IOCPDG_CNPDG3_LENGTH                    0x00000001

#define _IOCPDG_CNPDG6_POSITION                  0x00000006
#define _IOCPDG_CNPDG6_MASK                      0x00000040
#define _IOCPDG_CNPDG6_LENGTH                    0x00000001

#define _IOCPDG_CNPDG7_POSITION                  0x00000007
#define _IOCPDG_CNPDG7_MASK                      0x00000080
#define _IOCPDG_CNPDG7_LENGTH                    0x00000001

#define _IOCPDG_CNPDG8_POSITION                  0x00000008
#define _IOCPDG_CNPDG8_MASK                      0x00000100
#define _IOCPDG_CNPDG8_LENGTH                    0x00000001

#define _IOCPDG_CNPDG9_POSITION                  0x00000009
#define _IOCPDG_CNPDG9_MASK                      0x00000200
#define _IOCPDG_CNPDG9_LENGTH                    0x00000001

#define _IOCPDG_CNPDG12_POSITION                 0x0000000C
#define _IOCPDG_CNPDG12_MASK                     0x00001000
#define _IOCPDG_CNPDG12_LENGTH                   0x00000001

#define _IOCPDG_CNPDG13_POSITION                 0x0000000D
#define _IOCPDG_CNPDG13_MASK                     0x00002000
#define _IOCPDG_CNPDG13_LENGTH                   0x00000001

#define _IOCPDG_CNPDG14_POSITION                 0x0000000E
#define _IOCPDG_CNPDG14_MASK                     0x00004000
#define _IOCPDG_CNPDG14_LENGTH                   0x00000001

#define _IOCPDG_CNPDG15_POSITION                 0x0000000F
#define _IOCPDG_CNPDG15_MASK                     0x00008000
#define _IOCPDG_CNPDG15_LENGTH                   0x00000001

#define _TRISH_TRISH0_POSITION                   0x00000000
#define _TRISH_TRISH0_MASK                       0x00000001
#define _TRISH_TRISH0_LENGTH                     0x00000001

#define _TRISH_TRISH1_POSITION                   0x00000001
#define _TRISH_TRISH1_MASK                       0x00000002
#define _TRISH_TRISH1_LENGTH                     0x00000001

#define _TRISH_TRISH2_POSITION                   0x00000002
#define _TRISH_TRISH2_MASK                       0x00000004
#define _TRISH_TRISH2_LENGTH                     0x00000001

#define _TRISH_TRISH3_POSITION                   0x00000003
#define _TRISH_TRISH3_MASK                       0x00000008
#define _TRISH_TRISH3_LENGTH                     0x00000001

#define _TRISH_TRISH4_POSITION                   0x00000004
#define _TRISH_TRISH4_MASK                       0x00000010
#define _TRISH_TRISH4_LENGTH                     0x00000001

#define _TRISH_TRISH5_POSITION                   0x00000005
#define _TRISH_TRISH5_MASK                       0x00000020
#define _TRISH_TRISH5_LENGTH                     0x00000001

#define _TRISH_TRISH6_POSITION                   0x00000006
#define _TRISH_TRISH6_MASK                       0x00000040
#define _TRISH_TRISH6_LENGTH                     0x00000001

#define _TRISH_TRISH7_POSITION                   0x00000007
#define _TRISH_TRISH7_MASK                       0x00000080
#define _TRISH_TRISH7_LENGTH                     0x00000001

#define _TRISH_TRISH8_POSITION                   0x00000008
#define _TRISH_TRISH8_MASK                       0x00000100
#define _TRISH_TRISH8_LENGTH                     0x00000001

#define _TRISH_TRISH9_POSITION                   0x00000009
#define _TRISH_TRISH9_MASK                       0x00000200
#define _TRISH_TRISH9_LENGTH                     0x00000001

#define _TRISH_TRISH10_POSITION                  0x0000000A
#define _TRISH_TRISH10_MASK                      0x00000400
#define _TRISH_TRISH10_LENGTH                    0x00000001

#define _TRISH_TRISH11_POSITION                  0x0000000B
#define _TRISH_TRISH11_MASK                      0x00000800
#define _TRISH_TRISH11_LENGTH                    0x00000001

