MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB412/mcu.h
#define _LATH_LATH15_POSITION                    0x0000000F
#define _LATH_LATH15_MASK                        0x00008000
#define _LATH_LATH15_LENGTH                      0x00000001

#define _ODCH_ODCH0_POSITION                     0x00000000
#define _ODCH_ODCH0_MASK                         0x00000001
#define _ODCH_ODCH0_LENGTH                       0x00000001

#define _ODCH_ODCH1_POSITION                     0x00000001
#define _ODCH_ODCH1_MASK                         0x00000002
#define _ODCH_ODCH1_LENGTH                       0x00000001

#define _ODCH_ODCH2_POSITION                     0x00000002
#define _ODCH_ODCH2_MASK                         0x00000004
#define _ODCH_ODCH2_LENGTH                       0x00000001

#define _ODCH_ODCH3_POSITION                     0x00000003
#define _ODCH_ODCH3_MASK                         0x00000008
#define _ODCH_ODCH3_LENGTH                       0x00000001

#define _ODCH_ODCH4_POSITION                     0x00000004
#define _ODCH_ODCH4_MASK                         0x00000010
#define _ODCH_ODCH4_LENGTH                       0x00000001

#define _ODCH_ODCH5_POSITION                     0x00000005
#define _ODCH_ODCH5_MASK                         0x00000020
#define _ODCH_ODCH5_LENGTH                       0x00000001

#define _ODCH_ODCH6_POSITION                     0x00000006
#define _ODCH_ODCH6_MASK                         0x00000040
#define _ODCH_ODCH6_LENGTH                       0x00000001

#define _ODCH_ODCH7_POSITION                     0x00000007
#define _ODCH_ODCH7_MASK                         0x00000080
#define _ODCH_ODCH7_LENGTH                       0x00000001

#define _ODCH_ODCH8_POSITION                     0x00000008
#define _ODCH_ODCH8_MASK                         0x00000100
#define _ODCH_ODCH8_LENGTH                       0x00000001

#define _ODCH_ODCH9_POSITION                     0x00000009
#define _ODCH_ODCH9_MASK                         0x00000200
#define _ODCH_ODCH9_LENGTH                       0x00000001

#define _ODCH_ODCH10_POSITION                    0x0000000A
#define _ODCH_ODCH10_MASK                        0x00000400
#define _ODCH_ODCH10_LENGTH                      0x00000001

#define _ODCH_ODCH11_POSITION                    0x0000000B
#define _ODCH_ODCH11_MASK                        0x00000800
#define _ODCH_ODCH11_LENGTH                      0x00000001

#define _ODCH_ODCH12_POSITION                    0x0000000C
#define _ODCH_ODCH12_MASK                        0x00001000
#define _ODCH_ODCH12_LENGTH                      0x00000001

#define _ODCH_ODCH13_POSITION                    0x0000000D
#define _ODCH_ODCH13_MASK                        0x00002000
#define _ODCH_ODCH13_LENGTH                      0x00000001

#define _ODCH_ODCH14_POSITION                    0x0000000E
#define _ODCH_ODCH14_MASK                        0x00004000
#define _ODCH_ODCH14_LENGTH                      0x00000001

#define _ODCH_ODCH15_POSITION                    0x0000000F
#define _ODCH_ODCH15_MASK                        0x00008000
#define _ODCH_ODCH15_LENGTH                      0x00000001

#define _ANSELH_ANSH0_POSITION                   0x00000000
#define _ANSELH_ANSH0_MASK                       0x00000001
#define _ANSELH_ANSH0_LENGTH                     0x00000001

#define _ANSELH_ANSH1_POSITION                   0x00000001
#define _ANSELH_ANSH1_MASK                       0x00000002
#define _ANSELH_ANSH1_LENGTH                     0x00000001

#define _ANSELH_ANSH2_POSITION                   0x00000002
#define _ANSELH_ANSH2_MASK                       0x00000004
#define _ANSELH_ANSH2_LENGTH                     0x00000001

#define _ANSELH_ANSH3_POSITION                   0x00000003
#define _ANSELH_ANSH3_MASK                       0x00000008
#define _ANSELH_ANSH3_LENGTH                     0x00000001

#define _ANSELH_ANSH4_POSITION                   0x00000004
#define _ANSELH_ANSH4_MASK                       0x00000010
#define _ANSELH_ANSH4_LENGTH                     0x00000001

#define _ANSELH_ANSELH0_POSITION                 0x00000000
#define _ANSELH_ANSELH0_MASK                     0x00000001
#define _ANSELH_ANSELH0_LENGTH                   0x00000001

#define _ANSELH_ANSELH1_POSITION                 0x00000001
#define _ANSELH_ANSELH1_MASK                     0x00000002
#define _ANSELH_ANSELH1_LENGTH                   0x00000001

#define _ANSELH_ANSELH2_POSITION                 0x00000002
#define _ANSELH_ANSELH2_MASK                     0x00000004
#define _ANSELH_ANSELH2_LENGTH                   0x00000001

#define _ANSELH_ANSELH3_POSITION                 0x00000003
#define _ANSELH_ANSELH3_MASK                     0x00000008
#define _ANSELH_ANSELH3_LENGTH                   0x00000001

#define _ANSELH_ANSELH4_POSITION                 0x00000004
#define _ANSELH_ANSELH4_MASK                     0x00000010
#define _ANSELH_ANSELH4_LENGTH                   0x00000001

#define _ANSH_ANSH0_POSITION                     0x00000000
#define _ANSH_ANSH0_MASK                         0x00000001
#define _ANSH_ANSH0_LENGTH                       0x00000001

#define _ANSH_ANSH1_POSITION                     0x00000001
#define _ANSH_ANSH1_MASK                         0x00000002
#define _ANSH_ANSH1_LENGTH                       0x00000001

#define _ANSH_ANSH2_POSITION                     0x00000002
#define _ANSH_ANSH2_MASK                         0x00000004
#define _ANSH_ANSH2_LENGTH                       0x00000001

#define _ANSH_ANSH3_POSITION                     0x00000003
#define _ANSH_ANSH3_MASK                         0x00000008
#define _ANSH_ANSH3_LENGTH                       0x00000001

#define _ANSH_ANSH4_POSITION                     0x00000004
#define _ANSH_ANSH4_MASK                         0x00000010
#define _ANSH_ANSH4_LENGTH                       0x00000001

#define _ANSH_ANSELH0_POSITION                   0x00000000
#define _ANSH_ANSELH0_MASK                       0x00000001
#define _ANSH_ANSELH0_LENGTH                     0x00000001

#define _ANSH_ANSELH1_POSITION                   0x00000001
#define _ANSH_ANSELH1_MASK                       0x00000002
#define _ANSH_ANSELH1_LENGTH                     0x00000001

