MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB412/mcu.h
#define _RPINR7_IC2R2_POSITION                   0x0000000A
#define _RPINR7_IC2R2_MASK                       0x00000400
#define _RPINR7_IC2R2_LENGTH                     0x00000001

#define _RPINR7_IC2R3_POSITION                   0x0000000B
#define _RPINR7_IC2R3_MASK                       0x00000800
#define _RPINR7_IC2R3_LENGTH                     0x00000001

#define _RPINR7_IC2R4_POSITION                   0x0000000C
#define _RPINR7_IC2R4_MASK                       0x00001000
#define _RPINR7_IC2R4_LENGTH                     0x00000001

#define _RPINR7_IC2R5_POSITION                   0x0000000D
#define _RPINR7_IC2R5_MASK                       0x00002000
#define _RPINR7_IC2R5_LENGTH                     0x00000001

#define _RPINR8_IC3R_POSITION                    0x00000000
#define _RPINR8_IC3R_MASK                        0x0000003F
#define _RPINR8_IC3R_LENGTH                      0x00000006

#define _RPINR8_IC3R0_POSITION                   0x00000000
#define _RPINR8_IC3R0_MASK                       0x00000001
#define _RPINR8_IC3R0_LENGTH                     0x00000001

#define _RPINR8_IC3R1_POSITION                   0x00000001
#define _RPINR8_IC3R1_MASK                       0x00000002
#define _RPINR8_IC3R1_LENGTH                     0x00000001

#define _RPINR8_IC3R2_POSITION                   0x00000002
#define _RPINR8_IC3R2_MASK                       0x00000004
#define _RPINR8_IC3R2_LENGTH                     0x00000001

#define _RPINR8_IC3R3_POSITION                   0x00000003
#define _RPINR8_IC3R3_MASK                       0x00000008
#define _RPINR8_IC3R3_LENGTH                     0x00000001

#define _RPINR8_IC3R4_POSITION                   0x00000004
#define _RPINR8_IC3R4_MASK                       0x00000010
#define _RPINR8_IC3R4_LENGTH                     0x00000001

#define _RPINR8_IC3R5_POSITION                   0x00000005
#define _RPINR8_IC3R5_MASK                       0x00000020
#define _RPINR8_IC3R5_LENGTH                     0x00000001

#define _RPINR11_OCFAR_POSITION                  0x00000000
#define _RPINR11_OCFAR_MASK                      0x0000003F
#define _RPINR11_OCFAR_LENGTH                    0x00000006

#define _RPINR11_OCFBR_POSITION                  0x00000008
#define _RPINR11_OCFBR_MASK                      0x00003F00
#define _RPINR11_OCFBR_LENGTH                    0x00000006

#define _RPINR11_OCFAR0_POSITION                 0x00000000
#define _RPINR11_OCFAR0_MASK                     0x00000001
#define _RPINR11_OCFAR0_LENGTH                   0x00000001

#define _RPINR11_OCFAR1_POSITION                 0x00000001
#define _RPINR11_OCFAR1_MASK                     0x00000002
#define _RPINR11_OCFAR1_LENGTH                   0x00000001

#define _RPINR11_OCFAR2_POSITION                 0x00000002
#define _RPINR11_OCFAR2_MASK                     0x00000004
#define _RPINR11_OCFAR2_LENGTH                   0x00000001

#define _RPINR11_OCFAR3_POSITION                 0x00000003
#define _RPINR11_OCFAR3_MASK                     0x00000008
#define _RPINR11_OCFAR3_LENGTH                   0x00000001

#define _RPINR11_OCFAR4_POSITION                 0x00000004
#define _RPINR11_OCFAR4_MASK                     0x00000010
#define _RPINR11_OCFAR4_LENGTH                   0x00000001

#define _RPINR11_OCFAR5_POSITION                 0x00000005
#define _RPINR11_OCFAR5_MASK                     0x00000020
#define _RPINR11_OCFAR5_LENGTH                   0x00000001

#define _RPINR11_OCFBR0_POSITION                 0x00000008
#define _RPINR11_OCFBR0_MASK                     0x00000100
#define _RPINR11_OCFBR0_LENGTH                   0x00000001

#define _RPINR11_OCFBR1_POSITION                 0x00000009
#define _RPINR11_OCFBR1_MASK                     0x00000200
#define _RPINR11_OCFBR1_LENGTH                   0x00000001

#define _RPINR11_OCFBR2_POSITION                 0x0000000A
#define _RPINR11_OCFBR2_MASK                     0x00000400
#define _RPINR11_OCFBR2_LENGTH                   0x00000001

#define _RPINR11_OCFBR3_POSITION                 0x0000000B
#define _RPINR11_OCFBR3_MASK                     0x00000800
#define _RPINR11_OCFBR3_LENGTH                   0x00000001

#define _RPINR11_OCFBR4_POSITION                 0x0000000C
#define _RPINR11_OCFBR4_MASK                     0x00001000
#define _RPINR11_OCFBR4_LENGTH                   0x00000001

#define _RPINR11_OCFBR5_POSITION                 0x0000000D
#define _RPINR11_OCFBR5_MASK                     0x00002000
#define _RPINR11_OCFBR5_LENGTH                   0x00000001

#define _RPINR12_TCKIAR_POSITION                 0x00000000
#define _RPINR12_TCKIAR_MASK                     0x0000003F
#define _RPINR12_TCKIAR_LENGTH                   0x00000006

#define _RPINR12_TCKIBR_POSITION                 0x00000008
#define _RPINR12_TCKIBR_MASK                     0x00003F00
#define _RPINR12_TCKIBR_LENGTH                   0x00000006

#define _RPINR12_TCKIAR0_POSITION                0x00000000
#define _RPINR12_TCKIAR0_MASK                    0x00000001
#define _RPINR12_TCKIAR0_LENGTH                  0x00000001

#define _RPINR12_TCKIAR1_POSITION                0x00000001
#define _RPINR12_TCKIAR1_MASK                    0x00000002
#define _RPINR12_TCKIAR1_LENGTH                  0x00000001

#define _RPINR12_TCKIAR2_POSITION                0x00000002
#define _RPINR12_TCKIAR2_MASK                    0x00000004
#define _RPINR12_TCKIAR2_LENGTH                  0x00000001

#define _RPINR12_TCKIAR3_POSITION                0x00000003
#define _RPINR12_TCKIAR3_MASK                    0x00000008
#define _RPINR12_TCKIAR3_LENGTH                  0x00000001

#define _RPINR12_TCKIAR4_POSITION                0x00000004
#define _RPINR12_TCKIAR4_MASK                    0x00000010
#define _RPINR12_TCKIAR4_LENGTH                  0x00000001

#define _RPINR12_TCKIAR5_POSITION                0x00000005
#define _RPINR12_TCKIAR5_MASK                    0x00000020
#define _RPINR12_TCKIAR5_LENGTH                  0x00000001

#define _RPINR12_TCKIBR0_POSITION                0x00000008
#define _RPINR12_TCKIBR0_MASK                    0x00000100
#define _RPINR12_TCKIBR0_LENGTH                  0x00000001

#define _RPINR12_TCKIBR1_POSITION                0x00000009
#define _RPINR12_TCKIBR1_MASK                    0x00000200
#define _RPINR12_TCKIBR1_LENGTH                  0x00000001

#define _RPINR12_TCKIBR2_POSITION                0x0000000A
#define _RPINR12_TCKIBR2_MASK                    0x00000400
#define _RPINR12_TCKIBR2_LENGTH                  0x00000001

#define _RPINR12_TCKIBR3_POSITION                0x0000000B
#define _RPINR12_TCKIBR3_MASK                    0x00000800
#define _RPINR12_TCKIBR3_LENGTH                  0x00000001

#define _RPINR12_TCKIBR4_POSITION                0x0000000C
#define _RPINR12_TCKIBR4_MASK                    0x00001000
#define _RPINR12_TCKIBR4_LENGTH                  0x00000001

