MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB412/mcu.h
#define _RPINR27_U4CTSR3_POSITION                0x0000000B
#define _RPINR27_U4CTSR3_MASK                    0x00000800
#define _RPINR27_U4CTSR3_LENGTH                  0x00000001

#define _RPINR27_U4CTSR4_POSITION                0x0000000C
#define _RPINR27_U4CTSR4_MASK                    0x00001000
#define _RPINR27_U4CTSR4_LENGTH                  0x00000001

#define _RPINR27_U4CTSR5_POSITION                0x0000000D
#define _RPINR27_U4CTSR5_MASK                    0x00002000
#define _RPINR27_U4CTSR5_LENGTH                  0x00000001

#define _RPINR28_SDI3R_POSITION                  0x00000000
#define _RPINR28_SDI3R_MASK                      0x0000003F
#define _RPINR28_SDI3R_LENGTH                    0x00000006

#define _RPINR28_SCK3R_POSITION                  0x00000008
#define _RPINR28_SCK3R_MASK                      0x00003F00
#define _RPINR28_SCK3R_LENGTH                    0x00000006

#define _RPINR28_SDI3R0_POSITION                 0x00000000
#define _RPINR28_SDI3R0_MASK                     0x00000001
#define _RPINR28_SDI3R0_LENGTH                   0x00000001

#define _RPINR28_SDI3R1_POSITION                 0x00000001
#define _RPINR28_SDI3R1_MASK                     0x00000002
#define _RPINR28_SDI3R1_LENGTH                   0x00000001

#define _RPINR28_SDI3R2_POSITION                 0x00000002
#define _RPINR28_SDI3R2_MASK                     0x00000004
#define _RPINR28_SDI3R2_LENGTH                   0x00000001

#define _RPINR28_SDI3R3_POSITION                 0x00000003
#define _RPINR28_SDI3R3_MASK                     0x00000008
#define _RPINR28_SDI3R3_LENGTH                   0x00000001

#define _RPINR28_SDI3R4_POSITION                 0x00000004
#define _RPINR28_SDI3R4_MASK                     0x00000010
#define _RPINR28_SDI3R4_LENGTH                   0x00000001

#define _RPINR28_SDI3R5_POSITION                 0x00000005
#define _RPINR28_SDI3R5_MASK                     0x00000020
#define _RPINR28_SDI3R5_LENGTH                   0x00000001

#define _RPINR28_SCK3R0_POSITION                 0x00000008
#define _RPINR28_SCK3R0_MASK                     0x00000100
#define _RPINR28_SCK3R0_LENGTH                   0x00000001

#define _RPINR28_SCK3R1_POSITION                 0x00000009
#define _RPINR28_SCK3R1_MASK                     0x00000200
#define _RPINR28_SCK3R1_LENGTH                   0x00000001

#define _RPINR28_SCK3R2_POSITION                 0x0000000A
#define _RPINR28_SCK3R2_MASK                     0x00000400
#define _RPINR28_SCK3R2_LENGTH                   0x00000001

#define _RPINR28_SCK3R3_POSITION                 0x0000000B
#define _RPINR28_SCK3R3_MASK                     0x00000800
#define _RPINR28_SCK3R3_LENGTH                   0x00000001

#define _RPINR28_SCK3R4_POSITION                 0x0000000C
#define _RPINR28_SCK3R4_MASK                     0x00001000
#define _RPINR28_SCK3R4_LENGTH                   0x00000001

#define _RPINR28_SCK3R5_POSITION                 0x0000000D
#define _RPINR28_SCK3R5_MASK                     0x00002000
#define _RPINR28_SCK3R5_LENGTH                   0x00000001

#define _RPINR29_SS3R_POSITION                   0x00000000
#define _RPINR29_SS3R_MASK                       0x0000003F
#define _RPINR29_SS3R_LENGTH                     0x00000006

#define _RPINR29_SS3R0_POSITION                  0x00000000
#define _RPINR29_SS3R0_MASK                      0x00000001
#define _RPINR29_SS3R0_LENGTH                    0x00000001

#define _RPINR29_SS3R1_POSITION                  0x00000001
#define _RPINR29_SS3R1_MASK                      0x00000002
#define _RPINR29_SS3R1_LENGTH                    0x00000001

#define _RPINR29_SS3R2_POSITION                  0x00000002
#define _RPINR29_SS3R2_MASK                      0x00000004
#define _RPINR29_SS3R2_LENGTH                    0x00000001

#define _RPINR29_SS3R3_POSITION                  0x00000003
#define _RPINR29_SS3R3_MASK                      0x00000008
#define _RPINR29_SS3R3_LENGTH                    0x00000001

#define _RPINR29_SS3R4_POSITION                  0x00000004
#define _RPINR29_SS3R4_MASK                      0x00000010
#define _RPINR29_SS3R4_LENGTH                    0x00000001

#define _RPINR29_SS3R5_POSITION                  0x00000005
#define _RPINR29_SS3R5_MASK                      0x00000020
#define _RPINR29_SS3R5_LENGTH                    0x00000001

#define _RPOR0_RP0R_POSITION                     0x00000000
#define _RPOR0_RP0R_MASK                         0x0000003F
#define _RPOR0_RP0R_LENGTH                       0x00000006

#define _RPOR0_RP1R_POSITION                     0x00000008
#define _RPOR0_RP1R_MASK                         0x00003F00
#define _RPOR0_RP1R_LENGTH                       0x00000006

#define _RPOR0_RP0R0_POSITION                    0x00000000
#define _RPOR0_RP0R0_MASK                        0x00000001
#define _RPOR0_RP0R0_LENGTH                      0x00000001

#define _RPOR0_RP0R1_POSITION                    0x00000001
#define _RPOR0_RP0R1_MASK                        0x00000002
#define _RPOR0_RP0R1_LENGTH                      0x00000001

#define _RPOR0_RP0R2_POSITION                    0x00000002
#define _RPOR0_RP0R2_MASK                        0x00000004
#define _RPOR0_RP0R2_LENGTH                      0x00000001

#define _RPOR0_RP0R3_POSITION                    0x00000003
#define _RPOR0_RP0R3_MASK                        0x00000008
#define _RPOR0_RP0R3_LENGTH                      0x00000001

#define _RPOR0_RP0R4_POSITION                    0x00000004
#define _RPOR0_RP0R4_MASK                        0x00000010
#define _RPOR0_RP0R4_LENGTH                      0x00000001

#define _RPOR0_RP0R5_POSITION                    0x00000005
#define _RPOR0_RP0R5_MASK                        0x00000020
#define _RPOR0_RP0R5_LENGTH                      0x00000001

#define _RPOR0_RP1R0_POSITION                    0x00000008
#define _RPOR0_RP1R0_MASK                        0x00000100
#define _RPOR0_RP1R0_LENGTH                      0x00000001

#define _RPOR0_RP1R1_POSITION                    0x00000009
#define _RPOR0_RP1R1_MASK                        0x00000200
#define _RPOR0_RP1R1_LENGTH                      0x00000001

