MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB412/mcu.h
/*
 * Flash Programming Information
 */

#undef _FLASH_PAGE
#define _FLASH_PAGE 0x200

#undef _FLASH_ROW
#define _FLASH_ROW 0x40

/*
 * Memory Segments Sizes
 */


/*
 * Memory Segments Sizes that are always present
 */

#define __AIVT_BASE 0x0
#define __AIVT_LENGTH 0x100

#define __FBOOT_BASE 0x801800
#define __FBOOT_LENGTH 0x2

#define __DEVID_BASE 0xff0000
#define __DEVID_LENGTH 0x4

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x2000


/*
 * Single panel memory sizes
 */

#ifndef __DUAL_PARTITION
#define __AIVT_BASE 0x0
#define __AIVT_LENGTH 0x100

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0xfc

#define __PROGRAM_BASE 0x100
#define __PROGRAM_LENGTH 0xae80

#define __FSEC_BASE 0xaf80
#define __FSEC_LENGTH 0x2

#define __FBSLIM_BASE 0xaf90
#define __FBSLIM_LENGTH 0x2

#define __FSIGN_BASE 0xaf94
#define __FSIGN_LENGTH 0x2

#define __FOSCSEL_BASE 0xaf98
#define __FOSCSEL_LENGTH 0x2

#define __FOSC_BASE 0xaf9c
#define __FOSC_LENGTH 0x2

#define __FWDT_BASE 0xafa0
#define __FWDT_LENGTH 0x2

#define __FPOR_BASE 0xafa4
#define __FPOR_LENGTH 0x2

#define __FICD_BASE 0xafa8
#define __FICD_LENGTH 0x2

#define __FDS_BASE 0xafac
#define __FDS_LENGTH 0x2

#define __FDEVOPT1_BASE 0xafb0
#define __FDEVOPT1_LENGTH 0x2

#define __FBTSEQ_BASE 0xaffc
#define __FBTSEQ_LENGTH 0x2

#endif

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x2000


/*
 * Dual panel memory sizes
 */

#ifdef __DUAL_PARTITION
#define __AIVT_BASE 0x0
#define __AIVT_LENGTH 0x100

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0xfc

#define __PROGRAM_BASE 0x100
#define __PROGRAM_LENGTH 0x5680

#define __FSEC_BASE 0x5780
#define __FSEC_LENGTH 0x2

#define __FBSLIM_BASE 0x5790
#define __FBSLIM_LENGTH 0x2

#define __FSIGN_BASE 0x5794
#define __FSIGN_LENGTH 0x2

#define __FOSCSEL_BASE 0x5798
#define __FOSCSEL_LENGTH 0x2

#define __FOSC_BASE 0x579c
#define __FOSC_LENGTH 0x2

#define __FWDT_BASE 0x57a0
#define __FWDT_LENGTH 0x2

#define __FPOR_BASE 0x57a4
#define __FPOR_LENGTH 0x2

#define __FICD_BASE 0x57a8
#define __FICD_LENGTH 0x2

#define __FDS_BASE 0x57ac
#define __FDS_LENGTH 0x2

#define __FDEVOPT1_BASE 0x57b0
#define __FDEVOPT1_LENGTH 0x2

#define __FBTSEQ_BASE 0x57fc
#define __FBTSEQ_LENGTH 0x2

#endif

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x2000


/*
 * PPS Remapping Pin Names
 */

#define _RPOUT_OC1 13
#define _RPOUT_OCM4 16
#define _RPOUT_REFO1 28
#define _RPOUT_CLC1OUT 29
#define _RPOUT_C1OUT 1
#define _RPOUT_SCK1OUT 8
#define _RPOUT_SCK2OUT 11
#define _RPOUT_SCK3OUT 24
#define _RPOUT_OC2 14
#define _RPOUT_OCM5 17
#define _RPOUT_CLC2OUT 30
#define _RPOUT_C2OUT 2
#define _RPOUT_U1TX 3
#define _RPOUT_U2TX 5
#define _RPOUT_U3TX 19
#define _RPOUT_U4TX 21
#define _RPOUT_OC3 15
#define _RPOUT_OCM6 18
#define _RPOUT_C3OUT 26
#define _RPOUT_U1RTS 4
#define _RPOUT_U2RTS 6
#define _RPOUT_U3RTS 20
#define _RPOUT_U4RTS 22
#define _RPOUT_SDO1 7
#define _RPOUT_SDO2 10
#define _RPOUT_SDO3 23
#define _RPOUT_OCM7 27

#endif
